/*
#include<bits/stdc++.h>
using namespace std;
int main()
{
    int i,j,k,l=0,m,n,o;
    cin>>n>>m;
    int b[n],p[m];
    map<int,int>m1;
    for(i=0;i<n;i++)
    {
        cin>>b[i];
    }
    for(i=0;i<m;i++)
    {
        cin>>p[i];
    }


     for(j=0;j<m;j++)
     {
         for(i=0;i<n;i++)
         {
             if(p[j]<=b[i]&&m1[i]==0)
             {
                 cout<<p[j]<<" stored in "<<b[i]<<endl;
                 m1[i]=-1;
                 break;
             }
         }
     }

}

/*
#include<bits/stdc++.h>  // বিভিন্ন গুণগুলি এবং ডেটা স্ট্রাকচার প্রদান করার জন্য একটি লাইব্রেরি ইমপোর্ট করুন
using namespace std;  // স্ট্যান্ডার্ড নেমসপেস ব্যবহার করুন যাতে "std::" এক্সপ্লিসিটলি ব্যবহার করতে না হয়।

int main()
{
    int i, j, k, l = 0, m, n, o;  // একাধিক ভেরিয়েবল ডিক্লেয়ার করুন
    cin >> n >> m;  // n এবং m এর মান পড়ুন
    int b[n], p[m];  // প্রথমত, n টি বার্স্ট সময় এবং m টি প্রসেস সময়ের জন্য ভেরিয়েবল ডিক্লেয়ার করুন
    map<int, int> m1;  // একটি ম্যাপ ব্যবহার করুন যাতে আপডেট প্রক্রিয়ার স্থান সন্ধান করা যায়

    for (i = 0; i < n; i++)  // প্রথমত, সব বার্স্ট সময় পড়ুন
    {
        cin >> b[i];  // বার্স্ট সময় পড়ুন
    }
    for (i = 0; i < m; i++)  // তারপর, সব প্রসেস সময় পড়ুন
    {
        cin >> p[i];  // প্রসেস সময় পড়ুন
    }

    for (j = 0; j < m; j++)  // প্রতিটি প্রসেসের জন্য সারিগুলি চেক করুন
    {
        for (i = 0; i < n; i++)  // প্রতিটি বার্স্ট সময়ের জন্য সারিগুলি চেক করুন
        {
            if (p[j] <= b[i] && m1[i] == 0)  // যদি প্রসেসের সময় বার্স্ট সময়ের সমান বা কম এবং প্রসেসটি এখনও এই বার্স্ট সময়ে একটি প্রসেস বাস করা না হয়েছে তাহলে:
            {
                cout << p[j] << " stored in " << b[i] << endl;  // প্রসেসের সময় বার্স্ট সময়ে বাস করার স্থান প্রদর্শন করুন
                m1[i] = -1;  // প্রসেসটি বার্স্ট সময়ে বাস করা হয়ে গেছে তার চিহ্ন দেওয়া হয়েছে
                break;  // লুপ থেমে যান
            }
        }
    }
}


*/

/*
p1=20  block=15
p2=12  block=25
p3=15  block=10
p4=10  block=13
p5=14  block=17
*/
#include<bits/stdc++.h>
using namespace std;
int main()
{
    int i,j,k,l=0,m,n,o;
    cin>>n>>m;
    int b[n],p[m];
    map<int,int>m1;
    for(i=0;i<n;i++)
    {
        cin>>b[i];
    }
    for(i=0;i<m;i++)
    {
        cin>>p[i];
    }
     for(j=0;j<m;j++)
     {
         for(i=0;i<n;i++)
         {
             if(p[j]<=b[i]&&m1[i]==0)
             {
                 cout<<p[j]<<" stored in "<<b[i]<<endl;
                 m1[i]=-1;
                 break;
             }
         }
     }

}
